/**
 * 埋点文档
 */

// 个人中心
exports.wtCenter = {
  1: '0301_个人中心_点击_手机号码',
  2: '0302_个人中心_点击_风险评测',
  3: '0303_个人中心_点击_密码管理',
};

// 资产中心
exports.wtProperty = {
  1: '0101_我的_点击_个人中心',
  2: '0102_我的_点击_开户',
  3: '0103_我的_点击_总资产小问号',
  4: '0104_我的_点击_产品',
  5: '0105_我的_点击_买理财',
  6: '0106_我的_点击_app下载页',
  7: '0107_我的_点击_理财列表_投资理财',
  8: '0107_我的_点击_理财列表_亿账通',
  9: '0107_我的_点击_理财列表_基金'
};

// 收银台
exports.wtCashier = {
  1: '付款详情页_点击_确认支付',
  2: '交易密码对话框_点击_取消',
  3: '重置密码对话框_点击_知道了',
  4: 'OTP对话框_点击_获取验证码/重新获取',
  5: '单笔支付超限对话框_点击_知道了',
  6: '风控支付拒绝对话框_点击_知道了',
  7: '系统异常对话框_点击_知道了'
};

//登录、注册、找回密码
exports.wtLoginModule = {
  1: '0102_注册登录_验证手机号页_下一步',
  2: '0104_注册登录_设置登录密码页_注册',
  3: '0106_注册登录_登录页_找回密码',
  4: '0106_注册登录_登录页_弹窗_找回密码',
  5: '0107_注册登录_登录页_登录',
  6: '0202_找回密码_找回密码页_继续',
  7: '0204_找回密码_设置一个新密码页_完成'
};

// 风险评测 
exports.wtRisk = {
  1: '0301_风险评测_主动触发_未评测页_开始评估',
  2: '0302_风险评测_主动触发_评测结果已失效页_开始评估',
  3: '0303_风险评测_主动触发_有有效评测结果页_返回',
  4: '0304_风险评测_主动触发_有有效评测结果页_去看看理财产品',
  5: '0305_风险评测_主动触发_有有效评测结果页_重新评估',
  6: '0306_风险评测_购买触发_未评测页_开始评估',
  7: '0307_风险评测_购买触发_评测结果已失效页_开始评估',
  8: '0308_风险评测_购买触发_评测符合要求结果页_现在购买',
  9: '0309_风险评测_购买触发_评测符合要求结果页_下次再说',
  10: '0310_风险评测_购买触发_可重新评测结果页_重新评估',
  11: '0311_风险评测_购买触发_可重新评测结果页_下次再说',
  12: '0312_风险评测_购买触发_不可购买结果页_去看看其他产品',
  13: '0313_风险评测_购买触发_仍可购买结果页_仍要购买',
  14: '0314_风险评测_购买触发_仍可购买结果页_下次再说'
};

// 开户绑卡
exports.wtOpen = {
  1: '开户绑卡_实名认证_点击_下一步',
  2: '开户绑卡_实名认证_点击_返回',
  3: '开户绑卡_更换手机号弹框_点击_更换手机号',
  4: '开户绑卡_更换手机号弹框_点击_取消',
  5: '开户绑卡_绑定银行卡_点击_下一步',
  6: '开户绑卡_绑定银行卡_点击_协议',
  7: '开户绑卡_绑定银行卡_点击_返回',
  8: '开户绑卡_输入验证码弹框_点击_获取验证码',
  9: '开户绑卡_输入验证码弹框_点击_取消',
  10: '开户绑卡_验证码弹框_点击_提交',
  11: '开户绑卡_登录手机和银行预留手机号不一致弹框_点击_知道了',
  12: '开户绑卡_验证信息失败对话框_点击_知道了',
  13: '开户绑卡_设置交易密码_点击_提交',
  14: '开户绑卡_确认交易密码_点击_提交',
  15: '开户绑卡_设置交易密码_点击_返回'
};

/**
 * 添加按钮点击埋点
 * @param title
 */
exports.events = function(otitle) {
  if (typeof(pa_sdcajax) == 'function') {
    let pathname = location.pathname;
    let hostname = location.hostname;
    pa_sdcajax('WT.ti', otitle, false, 'WT.obj', 'button', false, 'DCS.dcsuri', pathname + '\/click.event',  false,  'WT.pageurl', 'http://' + hostname + pathname,  false,  'WT.pagetitle',  document.title,  false,  'WT.dl',  '25',  false,  'DCSext.wt_click', 'page', false);
  }
};
